# # -*- coding: utf-8 -*-
# # from  bert_serving.client import BertClient
# # bc = BertClient()
# # # new = []
# # str = ['<pad>', '<unk>', '<bos>', '<eos>', 'person_topic_b', '<num>', 'person_topic_a', 'video_topic_a', '_', '，', '-', '电影', '领域', '了', '明星', '。', '日期', '性别', '演员', '职业', '代表作', '瑞士', '出生', '女', '时光网', '的', '是', '(', ')', '奖', '提名', '最佳', '第<num>届', '获奖', '；', '金牛座', '星座', '男', '青少年选择奖', '精神', '评分', '他们', '孩子', '有', '还', '？', '国家', '洛桑', '萌', '·', '十分钟年华老去:大提琴篇', '<num>.<num>', 'adler', 'sarah', '上映', '信息', '制作人', '剧情', '发布', '口碑', '埃德勒', '年前', '很好', '戈老爷子', '欧洲', '欧洲电影奖', '短评', '祖籍', '类型', '莎拉', '那么', ':', 'start', '北京电影学院', '去', '啊', '好', '带', '毕业', '<num>kg', '<num>年', 'a型', '《', '》', '不错', '主要成就', '体重', '你', '在', '年轻', '得', '我', '标签', '气质', '火花', '现在', '男演员', '看到', '真爱至上', '神秘博士第三季', '移动迷宫_提名', '第一次', '翻', '血型', '评论', '这', '金卫星奖', '长大', '院校', '也', '呢', '我们', '谁', '高', '个', '吗', '很', '知道', '免得', '出去', '整天', '看电影', '让', '转转', '闹腾', '一样', '他', '外国', '大体', '头', '家', '想', '折腾', '揍', '看看', '给', '说说', '跟', '那', '都', '长', '<num>年<num>月<num>日', '不知道', '什么', '叫', '太', '真', '请问', '这个', '颜值', '一会', '主演', '么', '出门', '哥哥', '哦', '小', '就', '应', '才华', '没', '能','', '说过', '这部','', '', '', '', '', '', '','都是', '于', '安玛莉', '巧', '米耶维勒', '这么','']
# # new_str = list(filter(None,str))
# # # print(type(new_str))
# # a = bc.encode(new_str)
# # print(a)
# itos = []
# vocab_dict = {}
# vocab_dict={"video_topic_a": "我们 的 音乐", "person_topic_b": "安-玛莉 · 米耶维勒"}
# itos=list(vocab_dict)
# print (itos)
dictionary = {'src': {'itos': ['<pad>', '<unk>', '<bos>', '<eos>', 'person_topic_b', '<num>', 'person_topic_a', 'video_topic_a', '_', '，', '-', '电影', '领域', '了', '明星', '。', '日期', '性别', '演员', '职业', '代表作', '瑞士', '出生', '女', '时光网', '的', '是', '(', ')', '奖', '提名', '最佳', '第<num>届', '获奖', '；', '金牛座', '星座', '男', '青少年选择奖', '精神', '评分', '他们', '孩子', '有', '还', '？', '国家', '洛桑', '萌', '·', '十分钟年华老去:大提琴篇', '<num>.<num>', 'adler', 'sarah', '上映', '信息', '制作人', '剧情', '发布', '口碑', '埃德勒', '年前', '很好', '戈老爷子', '欧洲', '欧洲电影奖', '短评', '祖籍', '类型', '莎拉', '那么', ':', 'start', '北京电影学院', '去', '啊', '好', '带', '毕业', '<num>kg', '<num>年', 'a型', '《', '》', '不错', '主要成就', '体重', '你', '在', '年轻', '得', '我', '标签', '气质', '火花', '现在', '男演员', '看到', '真爱至上', '神秘博士第三季', '移动迷宫_提名', '第一次', '翻', '血型', '评论', '这', '金卫星奖', '长大', '院校', '也', '呢', '我们', '谁', '高', '个', '吗', '很', '知道', '免得', '出去', '整天', '看电影', '让', '转转', '闹腾', '一样', '他', '外国', '大体', '头', '家', '想', '折腾', '揍', '看看', '给', '说说', '跟', '那', '都', '长', '<num>年<num>月<num>日', '不知道', '什么', '叫', '太', '真', '请问', '这个', '颜值', '', '一会', '主演', '么', '出门', '哥哥', '哦', '小', '就', '应', '才华', '没', '能', '说过', '这部', '都是', '于', '安玛莉', '巧', '米耶维勒', '这么'],
			 'embeddings': None},
		 'tgt': {'itos': ['<pad>', '<unk>', '<bos>', '<eos>', 'person_topic_b', '<num>', 'person_topic_a', 'video_topic_a', '_', '，', '-', '电影', '领域', '了', '明星', '。', '日期', '性别', '演员', '职业', '代表作', '瑞士', '出生', '女', '时光网', '的', '是', '(', ')', '奖', '提名', '最佳', '第<num>届', '获奖', '；', '金牛座', '星座', '男', '青少年选择奖', '精神', '评分', '他们', '孩子', '有', '还', '？', '国家', '洛桑', '萌', '·', '十分钟年华老去:大提琴篇', '<num>.<num>', 'adler', 'sarah', '上映', '信息', '制作人', '剧情', '发布', '口碑', '埃德勒', '年前', '很好', '戈老爷子', '欧洲', '欧洲电影奖', '短评', '祖籍', '类型', '莎拉', '那么', ':', 'start', '北京电影学院', '去', '啊', '好', '带', '毕业', '<num>kg', '<num>年', 'a型', '《', '》', '不错', '主要成就', '体重', '你', '在', '年轻', '得', '我', '标签', '气质', '火花', '现在', '男演员', '看到', '真爱至上', '神秘博士第三季', '移动迷宫_提名', '第一次', '翻', '血型', '评论', '这', '金卫星奖', '长大', '院校', '也', '呢', '我们', '谁', '高', '个', '吗', '很', '知道', '免得', '出去', '整天', '看电影', '让', '转转', '闹腾', '一样', '他', '外国', '大体', '头', '家', '想', '折腾', '揍', '看看', '给', '说说', '跟', '那', '都', '长', '<num>年<num>月<num>日', '不知道', '什么', '叫', '太', '真', '请问', '这个', '颜值', '', '一会', '主演', '么', '出门', '哥哥', '哦', '小', '就', '应', '才华', '没', '能', '说过', '这部', '都是', '于', '安玛莉', '巧', '米耶维勒', '这么'],
			 'embeddings': None},
		 'cue': {'itos': ['<pad>', '<unk>', '<bos>', '<eos>', 'person_topic_b', '<num>', 'person_topic_a', 'video_topic_a', '_', '，', '-', '电影', '领域', '了', '明星', '。', '日期', '性别', '演员', '职业', '代表作', '瑞士', '出生', '女', '时光网', '的', '是', '(', ')', '奖', '提名', '最佳', '第<num>届', '获奖', '；', '金牛座', '星座', '男', '青少年选择奖', '精神', '评分', '他们', '孩子', '有', '还', '？', '国家', '洛桑', '萌', '·', '十分钟年华老去:大提琴篇', '<num>.<num>', 'adler', 'sarah', '上映', '信息', '制作人', '剧情', '发布', '口碑', '埃德勒', '年前', '很好', '戈老爷子', '欧洲', '欧洲电影奖', '短评', '祖籍', '类型', '莎拉', '那么', ':', 'start', '北京电影学院', '去', '啊', '好', '带', '毕业', '<num>kg', '<num>年', 'a型', '《', '》', '不错', '主要成就', '体重', '你', '在', '年轻', '得', '我', '标签', '气质', '火花', '现在', '男演员', '看到', '真爱至上', '神秘博士第三季', '移动迷宫_提名', '第一次', '翻', '血型', '评论', '这', '金卫星奖', '长大', '院校', '也', '呢', '我们', '谁', '高', '个', '吗', '很', '知道', '免得', '出去', '整天', '看电影', '让', '转转', '闹腾', '一样', '他', '外国', '大体', '头', '家', '想', '折腾', '揍', '看看', '给', '说说', '跟', '那', '都', '长', '<num>年<num>月<num>日', '不知道', '什么', '叫', '太', '真', '请问', '这个', '颜值', '', '一会', '主演', '么', '出门', '哥哥', '哦', '小', '就', '应', '才华', '没', '能', '说过', '这部', '都是', '于', '安玛莉', '巧', '米耶维勒', '这么'],
			 'embeddings': None}}
def getDic(traindata):
    '''

    :param traindata:
    :return:
    '''
    return dictionary
def getStr(x):
    list1 = []
    for k1, v1 in dictionary.items():
        for k2, v2 in v1.items():
            if v2 is not None:
                list1 = v2p
    return list1

dictionary = getDic(traindata=traindata)
a = getStr(dictionary)
print (a)



